Revit 2027 API
BuiltInFailures.SketchFailures.TooManySlopesError Property
 There is more than one slope defined.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TooManySlopesError { get; }
Public Shared ReadOnly Property TooManySlopesError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TooManySlopesError {
	FailureDefinitionId^ get ();
}
static member TooManySlopesError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace